---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface
source: html/743d9431-08a7-e19f-e33a-dba298741ec4.htm
---
# EnergyAnalysisSurface Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.